John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
    // --- SD Card Download ---
    // CSS and JS are now inline in index.html, no need to serve files
    // But keep stream logic etc.
    webConfigServer.on("/api/sd/download", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        if (!webConfigServer.hasArg("file")) {
            webConfigServer.send(400, "text/plain", "Missing file param");
            return;
        }
        String filename = "/" + webConfigServer.arg("file");
        File file = SD_MMC.open(filename, "r");
        if (!file) {
            webConfigServer.send(404, "text/plain", "File not found");
            return;
        }
        webConfigServer.streamFile(file, "application/octet-stream");
        file.close();
    });

    // --- SD Card Delete ---
    webConfigServer.on("/api/sd/delete", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<128> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        if (err || !doc.containsKey("file")) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Invalid request\"}");
            return;
        }
        String filename = "/" + doc["file"].as<String>();
        if (SD_MMC.remove(filename)) {
            webConfigServer.send(200, "application/json", "{\"ok\":1}");
        } else {
            webConfigServer.send(404, "application/json", "{\"error\":\"Delete failed\"}");
        }
    });

    // --- SD Recording Trigger ---
    webConfigServer.on("/api/record", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        StaticJsonDocument<128> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        String action = doc["action"];
        
        if (action == "start") {
            sd_recorder_start_manual();
        } else if (action == "stop") {
            sd_recorder_stop_manual();
        }
        
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });

    // --- Flash Control ---
    webConfigServer.on("/api/flash", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<64> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        bool state = doc["state"];
        
        // If manual control is used, disable auto flash temporarily (or user should toggle it off first)
        // But for simplicity, we just set the LED.
        set_flash_led(state);
        webConfigServer.send(200, "application/json", "{}");
    });
    
    webConfigServer.on("/api/autoflash", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<64> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        bool enabled = doc["enabled"];
        auto_flash_set_enabled(enabled);
        webConfigServer.send(200, "application/json", "{}");
    });
    
    // --- ONVIF Enable/Disable ---
    webConfigServer.on("/api/onvif/toggle", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<64> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        bool enabled = doc["enabled"];
        onvif_set_enabled(enabled);
        webConfigServer.send(200, "application/json", "{}");
    });

    // --- Reboot ---
    webConfigServer.on("/reboot", []() {
        if (!isAuthenticated(webConfigServer)) return;
        webConfigServer.send(200, "application/json", "{\"ok\":1, \"msg\":\"Rebooting...\"}");
        delay(1000);
        ESP.restart();
    });

    // --- Factory Reset (stub) ---
    webConfigServer.on("/api/factory_reset", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        // Reset settings logic here
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
        ESP.restart();
    });

    // --- System Information (Enhanced with RSSI, FPS, etc.) ---
    webConfigServer.on("/api/system/info", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        sensor_t * s = esp_camera_sensor_get();
        framesize_t res = s->status.framesize;
        
        String resolution = "Unknown";
        switch(res) {
            case FRAMESIZE_QQVGA: resolution = "QQVGA (160x120)"; break;
            case FRAMESIZE_QVGA:  resolution = "QVGA (320x240)"; break;
            case FRAMESIZE_VGA:   resolution = "VGA (640x480)"; break;
            case FRAMESIZE_SVGA:  resolution = "SVGA (800x600)"; break;
            case FRAMESIZE_HD:    resolution = "HD (1280x720)"; break;
            case FRAMESIZE_SXGA:  resolution = "SXGA (1280x1024)"; break;
            case FRAMESIZE_UXGA:  resolution = "UXGA (1600x1200)"; break;
            default: resolution = "Custom"; break;
        }
        
        String codec = "MJPEG";
        #ifdef VIDEO_CODEC_H264
            codec = "H.264";
        #endif
        
        int rssi = WiFi.RSSI();
        
        // Get flash partition info
        size_t flash_size = ESP.getFlashChipSize();
        size_t sketch_size = ESP.getSketchSize();
        size_t free_flash = flash_size - sketch_size;
        
        // PSRAM info (if available)
        size_t psram_size = 0;
        size_t psram_free = 0;
        #ifdef BOARD_HAS_PSRAM
            psram_size = ESP.getPsramSize();
            psram_free = ESP.getFreePsram();
        #endif
        
        String json = "{";
        json += "\"rssi\":" + String(rssi) + ",";
        json += "\"resolution\":\"" + resolution + "\",";
        json += "\"codec\":\"" + codec + "\",";
        json += "\"quality\":" + String(s->status.quality) + ",";
        json += "\"brightness\":" + String(s->status.brightness) + ",";
        json += "\"contrast\":" + String(s->status.contrast) + ",";
        json += "\"saturation\":" + String(s->status.saturation) + ",";
        json += "\"flash_total\":" + String(flash_size) + ",";
        json += "\"flash_used\":" + String(sketch_size) + ",";
        json += "\"flash_free\":" + String(free_flash) + ",";
        json += "\"psram_total\":" + String(psram_size) + ",";
        json += "\"psram_free\":" + String(psram_free);
        json += "}";
        
